Tekla Open API Reference for Tekla Structures 2025
Text.Attributes Property
 The attributes for the text.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Text.TextAttributes Attributes { get; set; }
Public Property Attributes As Text.TextAttributes
	Get
	Set
Property Value
Type: Text.TextAttributes
See Also
Reference
Text Class
Tekla.Structures.Drawing Namespace